#include <iostream>
using namespace std;
int main(){
 int numbers[5]; // numbers хүснэгтийг зарлаж байна

  int * p; // хаяган хувьсагч зарлаж байна

  p = numbers;  *p = 10; //  p хувьсагчаар дамжуулан numbers ийн эхний утгын 10 болгож байна

  p++;  *p = 20; // p хувьсагчийг дараагийн хягийг заалган тэр хаягт 20 гэдэг утга оноож байна.

  p = &numbers[2];  *p = 30; // p д numbers ийн 2 дахь index ийн хаягийг дамжуулан тэр хаягт 30 утга оноож байна

  p = numbers + 3;  *p = 40; // p ийн зааж 4 дэх хаягийг заан 40 утга авч байна

  p = numbers;  *(p+4) = 50; // p ийн зааж буй хаягийг 4 ээр ихэсгэн тэр хаягт 50 утга олгож байна

  for (int n=0; n<5; n++) 

    cout << numbers[n] << ", "; // хэвлэх
}